# 4- Определить, позицию второго вхождения строки в списке либо сообщить, что её нет.
# Примеры
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

list_arr = ["qw2e", "asd", "zxc", "qwre", "ertqwe"]
num = input("Input string: ")
count = []
for i in range(len(list_arr)):
    if str(num) in list_arr[i]:
        count.append(i)

try:
    print(count[1])
except:
    print("Второго вхождения в список нет.")