# 2 - Задайте последовательность чисел. 
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности. Не использовать множества.
# [1,1,1,1,2,2,2,3,3,3,4] -> [1,2,3,4]

# ========================================= 1 вариант ===============================================
# num_list = [1, 2, 3, 5, 1, 5, 3, 10, 15, 42]
# list_new = list(set(num_list))# Создает неупорядоченную коллекцию уникальных элементов

# print(f'Уникальные элементы в списке {num_list} -> {list_new}')
# ===================================================================================================


num_list = [1, 2, 3, 5, 1, 5, 3, 10]
list_new = []
for num in num_list:
    if num not in list_new:
        list_new.append(num)
print(f'Уникальные элементы в списке {num_list} -> {list_new}')